vimeo_clone/app/views/api/posts/index.json.jbuilder

SELECT "posts".* FROM "posts"
---
        json.uploaderPosts do
            post.user.posts.each do |post|