vimeo_clone/app/views/api/posts/show.json.jbuilder

  json.uploaderPosts do
    @post.user.posts.each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 134]]

json.comments do
  @post.comments.each do |comment|
---
SELECT "comments"."id" FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 50]]