vimeo_clone/app/views/api/users/_user.json.jbuilder

SELECT "followers".* FROM "followers" WHERE "followers"."follower_id" = $1  [["follower_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 128], ["LIMIT", 1]]
---
json.followers do
  user.followers.each do |follow|
    json.set! follow.id do
      followingUser = User.find(follow.user_id)