vimeo_clone/app/views/api/users/show.json.jbuilder

json.user_posts do
  @user.posts.each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

json.user_followers do
  @user.followers.each do |follower|
---
SELECT "followers".* FROM "followers" WHERE "followers"."follower_id" = $1  [["follower_id", 1]]