vimeo_clone/app/models/user.rb

    def reset_session_token!
      self.session_token = SecureRandom.urlsafe_base64(16)
      self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "H36hJ0PFtciNql10OQ8fog"], ["updated_at", "2020-03-11 15:58:02.988552"], ["id", 1]]