vimeo_clone/app/models/user.rb

    def reset_session_token!
      self.session_token = SecureRandom.urlsafe_base64(16)
      self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jMZNXD0V1JIfZ2H3_sknbg"], ["updated_at", "2020-03-05 03:47:14.662109"], ["id", 3]]