vimeo_clone/app/controllers/api/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 90]]
---
    def show
      @post = Post
        .includes(:comments)
        .includes(:likes)
        .find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]
---
    def create
      @post = Post.find(params[:id])