vimeo_clone/app/controllers/api/users_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
    def show
      @user = User
            .includes(:posts)
            .find(params[:id])